#Вывести все ключевые имена в словаре по одному:
#for x in thisdict:
#  print(x)